// Задание 1:
// Используя цикл for, выведите в консоль 11 строк, где каждая строка содержит
// индекс и описание числа (0 - это ноль, 1 - нечетное число, 2 - четное число и т.д.).
//
// for (let i = 0; i <= 10; i++) {
//     if (i === 0) {
//         console.log(`${i} - это ноль`);
//     } else if (i % 2 === 0) {
//         console.log(`${i} - четное число`);
//     } else {
//         console.log(`${i} - нечетное число`)
//     }
// }


// Задание 2:
// Описание задачи: Имеется массив [1, 2, 3, 4, 5, 6, 7]. Необходимо удалить
// элементы 4 и 5, чтобы получить массив [1, 2, 3, 6, 7].
//
// const arr = [1, 2, 3, 4, 5, 6, 7];
// arr.splice(3, 2)
// console.log(arr) //[1, 2, 3, 6, 7]


// Задание 3:
// Описание задачи:
// 1. Сгенерируйте массив из 5 случайных цифр от 0 до 9.
// 2. Рассчитайте сумму элементов массива.
// 3. Найдите минимальное число в массиве.
// 4. Определите, есть ли в массиве число 3.
//
// let arr = [];
// for (let i = 0; i < 5; i++) {
//     arr.push(Math.floor(Math.random() * 10));
// }





// for (начало; условие; шаг) {
//
//     // Тело цикла
//
// }

let num = +prompt()

for (let i = 0; i <= 60; i++) {
    console.log(`Поехали ${i}`)
}


































